# Instalacion de paquetes
Instalar pip a travès del notebook

In [ ]:
!pip install pandas

# Packages import 
Se deben importar los paquetes al inicio del archivo

In [ ]:
import pandas as pd

# Carga de datos

In [24]:
data = {
    'Nombre': ['Rodolfo', 'Eva', 'María', 'Rosa'],
    'Edad': [46, 43, 9, 37],
    'Ciudad': ['Punta Arenas', 'Santiago', 'Osorno', 'Osorno'],
    'Salario': [1400000, 1800000, None, 4500000],
    'Departamento': ['IT', 'Ventas', None, 'Recursos Humanos']
}
df = pd.DataFrame(data)
df

    Nombre  Edad        Ciudad    Salario      Departamento
0  Rodolfo    46  Punta Arenas  1400000.0                IT
1      Eva    43      Santiago  1800000.0            Ventas
2    María     9        Osorno        NaN              None
3     Rosa    37        Osorno  4500000.0  Recursos Humanos

In [ ]:
df.info()

In [ ]:
df.isnull()

In [ ]:
df.isnull().sum()

In [19]:
df.isnull().sum().sort_values(ascending=False)

Departamento    1
Salario         1
Nombre          0
Ciudad          0
Edad            0
dtype: int64

In [25]:
df.dropna()

    Nombre  Edad        Ciudad    Salario      Departamento
0  Rodolfo    46  Punta Arenas  1400000.0                IT
1      Eva    43      Santiago  1800000.0            Ventas
3     Rosa    37        Osorno  4500000.0  Recursos Humanos

In [27]:
df

    Nombre  Edad        Ciudad    Salario      Departamento
0  Rodolfo    46  Punta Arenas  1400000.0                IT
1      Eva    43      Santiago  1800000.0            Ventas
2    María     9        Osorno        NaN              None
3     Rosa    37        Osorno  4500000.0  Recursos Humanos

In [28]:
df.loc[1, "Nombre"]

'Eva'

In [30]:
df.iloc[0:2, 1:3]

   Edad        Ciudad
0    46  Punta Arenas
1    43      Santiago

In [31]:
df

    Nombre  Edad        Ciudad    Salario      Departamento
0  Rodolfo    46  Punta Arenas  1400000.0                IT
1      Eva    43      Santiago  1800000.0            Ventas
2    María     9        Osorno        NaN              None
3     Rosa    37        Osorno  4500000.0  Recursos Humanos

In [32]:
df["nueva_columna"] = "Columna"

In [34]:
df["Salario_anual"] = df["Salario"] * 12
df

,Nombre,Edad,Ciudad,Salario,Departamento,nueva_columna,Salario_anual
0,Rodolfo,46,Punta Arenas,1400000.0,IT,Columna,16800000.0
1,Eva,43,Santiago,1800000.0,Ventas,Columna,21600000.0
2,María,9,Osorno,NaN,None,Columna,NaN
3,Rosa,37,Osorno,4500000.0,Recursos Humanos,Columna,54000000.0

In [37]:
df["Nombre"] = df["Nombre"].str.lower()
df

,Nombre,Edad,Ciudad,Salario,Departamento,nueva_columna,Salario_anual
0,rodolfo,46,Punta Arenas,1400000.0,IT,Columna,16800000.0
1,eva,43,Santiago,1800000.0,Ventas,Columna,21600000.0
2,maría,9,Osorno,NaN,None,Columna,NaN
3,rosa,37,Osorno,4500000.0,Recursos Humanos,Columna,54000000.0

In [40]:
df.rename(columns={"nueva_columna": "columna"})

,Nombre,Edad,Ciudad,Salario,Departamento,columna,Salario_anual
0,rodolfo,46,Punta Arenas,1400000.0,IT,Columna,16800000.0
1,eva,43,Santiago,1800000.0,Ventas,Columna,21600000.0
2,maría,9,Osorno,NaN,None,Columna,NaN
3,rosa,37,Osorno,4500000.0,Recursos Humanos,Columna,54000000.0

In [42]:
df.loc[0, "Edad"] = 1
df

,Nombre,Edad,Ciudad,Salario,Departamento,nueva_columna,Salario_anual
0,rodolfo,1,Punta Arenas,1400000.0,IT,Columna,16800000.0
1,eva,43,Santiago,1800000.0,Ventas,Columna,21600000.0
2,maría,9,Osorno,NaN,None,Columna,NaN
3,rosa,37,Osorno,4500000.0,Recursos Humanos,Columna,54000000.0

In [45]:
df.duplicated(subset=["nueva_columna", "Ciudad"])

0    False
1    False
2    False
3     True
dtype: bool

In [47]:
df.drop_duplicates(subset=["Ciudad"])

,Nombre,Edad,Ciudad,Salario,Departamento,nueva_columna,Salario_anual
0,rodolfo,1,Punta Arenas,1400000.0,IT,Columna,16800000.0
1,eva,43,Santiago,1800000.0,Ventas,Columna,21600000.0
2,maría,9,Osorno,NaN,None,Columna,NaN

In [56]:
lista = list(df.columns)
lista

['Nombre',
 'Edad',
 'Ciudad',
 'Salario',
 'Departamento',
 'nueva_columna',
 'Salario_anual']

In [57]:
df[df["Edad"] > 18]

,Nombre,Edad,Ciudad,Salario,Departamento,nueva_columna,Salario_anual
1,eva,43,Santiago,1800000.0,Ventas,Columna,21600000.0
3,rosa,37,Osorno,4500000.0,Recursos Humanos,Columna,54000000.0

In [58]:
df["Edad"].apply(lambda x: x > 18)

0    False
1     True
2    False
3     True
Name: Edad, dtype: bool

In [59]:
df[df["Edad"].apply(lambda x: x > 18)]

,Nombre,Edad,Ciudad,Salario,Departamento,nueva_columna,Salario_anual
1,eva,43,Santiago,1800000.0,Ventas,Columna,21600000.0
3,rosa,37,Osorno,4500000.0,Recursos Humanos,Columna,54000000.0

In [61]:
df["categoria"] = df["Edad"].apply(lambda x: "Joven" if x < 30 else "Adulto")
df

,Nombre,Edad,Ciudad,Salario,Departamento,nueva_columna,Salario_anual,categoria
0,rodolfo,1,Punta Arenas,1400000.0,IT,Columna,16800000.0,Joven
1,eva,43,Santiago,1800000.0,Ventas,Columna,21600000.0,Adulto
2,maría,9,Osorno,NaN,None,Columna,NaN,Joven
3,rosa,37,Osorno,4500000.0,Recursos Humanos,Columna,54000000.0,Adulto

In [65]:
df.groupby("Ciudad")["Salario"].mean()

Ciudad
Osorno          4500000.0
Punta Arenas    1400000.0
Santiago        1800000.0
Name: Salario, dtype: float64

In [68]:
personas = pd.read_csv("../raw_data/personas.csv")
personas

    id           nombre  edad           correo_electronico  ingresos
0    1       Juan Pérez    34       juan.perez@example.com    700000
1    2        Ana Gómez    28        ana.gomez@example.com    560000
2    3   Pedro Martínez    45   pedro.martinez@example.com   1200000
3    4  Laura Fernández    31  laura.fernandez@example.com   1000000
4    5      María López    29      maria.lopez@example.com   2300000
5    6   Carlos Sánchez    40   carlos.sanchez@example.com   1300000
6    7      Isabel Ruiz    37                          NaN    800000
7    8  Antonio Morales    50  antonio.morales@example.com    800000
8    9   Lucía Martínez    26   lucia.martinez@example.com   1100000
9   10   Roberto Castro    33                          NaN    450000
10  11       Elena Díaz    39       elena.diaz@example.com    900000
11  12      David Gómez    42      david.gomez@example.com    800000
12  13       Paola Ríos    30       paola.rios@example.com    940000
13  14   José Fernández    48                          NaN   2300000
14  15     Sandra López    27     sandra.lopez@example.com   1800000
15  16  Marcelo Sánchez    36                          NaN    600000

In [69]:
orden = pd.read_csv("../raw_data/orden.csv")
orden

    persona_id  producto_id fecha_compra  cantidad    metodo_pago
0            1           10   2024-08-16         2       efectivo
1            4           17   2024-06-26         1  transferencia
2           12            9   2024-04-17         1         debito
3            3            6   2024-07-02         3  transferencia
4           16            1   2024-06-30         1         debito
5            6            4   2024-07-01         1  transferencia
6           11           23   2024-07-04         2         debito
7            7            5   2024-02-04         1  transferencia
8            8           16   2024-01-17         1         debito
9           14            8   2024-06-23         2         debito
10           9           20   2024-03-07         1         debito
11           2            3   2024-04-19         1  transferencia
12           5            2   2024-07-03         2       efectivo
13           1           21   2024-06-29         1         debito
14           5           14   2024-06-25         2  transferencia
15           3           12   2024-06-24         3  transferencia
16           6           18   2024-06-28         1         debito
17           8           19   2024-06-27         1  transferencia
18           9           22   2024-06-25         1         debito
19           1            7   2024-06-24         1  transferencia
20           1           11   2024-06-23         1       efectivo
21           2           13   2024-06-22         1  transferencia
22           1           10   2024-08-16         2         debito
23           4           17   2024-06-26         1         debito
24          12            9   2024-04-17         1       efectivo
25           3            6   2024-07-02         3  transferencia
26          16            1   2024-06-30         1         debito
27           6            4   2024-07-01         1       efectivo
28          11           23   2024-07-04         2  transferencia
29           7            5   2024-02-04         1         debito
30           8           16   2024-01-17         1  transferencia
31          14            8   2024-06-23         2       efectivo
32           9           20   2024-03-07         1         debito
33           2            3   2024-04-19         1       efectivo
34           5            2   2024-07-03         2  transferencia
35           1           21   2024-06-29         1       efectivo
36           5           14   2024-06-25         2         debito
37           3           12   2024-06-24         3         debito
38           6           18   2024-06-28         1       efectivo
39           8           19   2024-06-27         1  transferencia
40           9           22   2024-06-25         1         debito
41           1            7   2024-06-24         1       efectivo
42           1           11   2024-06-23         1  transferencia
43           2           13   2024-06-22         1         debito

In [75]:
new_df = pd.merge(personas, orden, left_on=["id"], right_on=["persona_id"], how="")
new_df

,id,nombre,edad,correo_electronico,ingresos,persona_id,producto_id,fecha_compra,cantidad,metodo_pago
0,1,Juan Pérez,34,juan.perez@example.com,700000,1,10,2024-08-16,2,efectivo
1,1,Juan Pérez,34,juan.perez@example.com,700000,1,21,2024-06-29,1,debito
2,1,Juan Pérez,34,juan.perez@example.com,700000,1,7,2024-06-24,1,transferencia
3,1,Juan Pérez,34,juan.perez@example.com,700000,1,11,2024-06-23,1,efectivo
4,1,Juan Pérez,34,juan.perez@example.com,700000,1,10,2024-08-16,2,debito
5,1,Juan Pérez,34,juan.perez@example.com,700000,1,21,2024-06-29,1,efectivo
6,1,Juan Pérez,34,juan.perez@example.com,700000,1,7,2024-06-24,1,efectivo
7,1,Juan Pérez,34,juan.perez@example.com,700000,1,11,2024-06-23,1,transferencia
8,2,Ana Gómez,28,ana.gomez@example.com,560000,2,3,2024-04-19,1,transferencia
9,2,Ana Gómez,28,ana.gomez@example.com,560000,2,13,2024-06-22,1,transferencia
10,2,Ana Gómez,28,ana.gomez@example.com,560000,2,3,2024-04-19,1,efectivo
11,2,Ana Gómez,28,ana.gomez@example.com,560000,2,13,2024-06-22,1,debito
12,3,Pedro Martínez,45,pedro.martinez@example.com,1200000,3,6,2024-07-02,3,transferencia
13,3,Pedro Martínez,45,pedro.martinez@example.com,1200000,3,12,2024-06-24,3,transferencia
14,3,Pedro Martínez,45,pedro.martinez@example.com,1200000,3,6,2024-07-02,3,transferencia
15,3,Pedro Martínez,45,pedro.martinez@example.com,1200000,3,12,2024-06-24,3,debito
16,4,Laura Fernández,31,laura.fernandez@example.com,1000000,4,17,2024-06-26,1,transferencia
17,4,Laura Fernández,31,laura.fernandez@example.com,1000000,4,17,2024-06-26,1,debito
18,5,María López,29,maria.lopez@example.com,2300000,5,2,2024-07-03,2,efectivo
19,5,María López,29,maria.lopez@example.com,2300000,5,14,2024-06-25,2,transferencia
20,5,María López,29,maria.lopez@example.com,2300000,5,2,2024-07-03,2,transferencia
21,5,María López,29,maria.lopez@example.com,2300000,5,14,2024-06-25,2,debito
22,6,Carlos Sánchez,40,carlos.sanchez@example.com,1300000,6,4,2024-07-01,1,transferencia
23,6,Carlos Sánchez,40,carlos.sanchez@example.com,1300000,6,18,2024-06-28,1,debito
24,6,Carlos Sánchez,40,carlos.sanchez@example.com,1300000,6,4,2024-07-01,1,efectivo
25,6,Carlos Sánchez,40,carlos.sanchez@example.com,1300000,6,18,2024-06-28,1,efectivo
26,7,Isabel Ruiz,37,NaN,800000,7,5,2024-02-04,1,transferencia
27,7,Isabel Ruiz,37,NaN,800000,7,5,2024-02-04,1,debito
28,8,Antonio Morales,50,antonio.morales@example.com,800000,8,16,2024-01-17,1,debito
29,8,Antonio Morales,50,antonio.morales@example.com,800000,8,19,2024-06-27,1,transferencia
30,8,Antonio Morales,50,antonio.morales@example.com,800000,8,16,2024-01-17,1,transferencia
31,8,Antonio Morales,50,antonio.morales@example.com,800000,8,19,2024-06-27,1,transferencia
32,9,Lucía Martínez,26,lucia.martinez@example.com,1100000,9,20,2024-03-07,1,debito
33,9,Lucía Martínez,26,lucia.martinez@example.com,1100000,9,22,2024-06-25,1,debito
34,9,Lucía Martínez,26,lucia.martinez@example.com,1100000,9,20,2024-03-07,1,debito
35,9,Lucía Martínez,26,lucia.martinez@example.com,1100000,9,22,2024-06-25,1,debito
36,11,Elena Díaz,39,elena.diaz@example.com,900000,11,23,2024-07-04,2,debito
37,11,Elena Díaz,39,elena.diaz@example.com,900000,11,23,2024-07-04,2,transferencia
38,12,David Gómez,42,david.gomez@example.com,800000,12,9,2024-04-17,1,debito
39,12,David Gómez,42,david.gomez@example.com,800000,12,9,2024-04-17,1,efectivo
40,14,José Fernández,48,NaN,2300000,14,8,2024-06-23,2,debito
41,14,José Fernández,48,NaN,2300000,14,8,2024-06-23,2,efectivo
42,16,Marcelo Sánchez,36,NaN,600000,16,1,2024-06-30,1,debito
43,16,Marcelo Sánchez,36,NaN,600000,16,1,2024-06-30,1,debito

In [78]:
pd.to_datetime(orden["fecha_compra"])

0    2024-08-16
1    2024-06-26
2    2024-04-17
3    2024-07-02
4    2024-06-30
5    2024-07-01
6    2024-07-04
7    2024-02-04
8    2024-01-17
9    2024-06-23
10   2024-03-07
11   2024-04-19
12   2024-07-03
13   2024-06-29
14   2024-06-25
15   2024-06-24
16   2024-06-28
17   2024-06-27
18   2024-06-25
19   2024-06-24
20   2024-06-23
21   2024-06-22
22   2024-08-16
23   2024-06-26
24   2024-04-17
25   2024-07-02
26   2024-06-30
27   2024-07-01
28   2024-07-04
29   2024-02-04
30   2024-01-17
31   2024-06-23
32   2024-03-07
33   2024-04-19
34   2024-07-03
35   2024-06-29
36   2024-06-25
37   2024-06-24
38   2024-06-28
39   2024-06-27
40   2024-06-25
41   2024-06-24
42   2024-06-23
43   2024-06-22
Name: fecha_compra, dtype: datetime64[ns]

# Ejercicios (Evaluado)
El Jupyter Notebook debe ser enviado al correo david.medina@umag.cl. Se dará hasta el Lunes 09/09 antes de la clase como plazo máximo.

Utilizando los set de datos en raw_data se pide realizar las siguientes tareas:

## 1. Filtrado y seleccion de datos (1 pt)
- Selecciona todas las personas que tienen más de 30 años.
- Encuentra todos los productos con un descuento superior a 10%.
- Filtra las órdenes realizadas con el método de pago "debito".

## 2. Analisis de duplicados y llenado de nulos (1 pt)
- Rellena los valores nulos de correo electrónico con el formato {nombre}.{apellido}@example.com
- Adicionalmente se solicita quitar las tildes

## 3. Agrupación y Resumen de Datos (Parte 1) (0.5 pt)
- Une el dataset de orden con personas para obtener la información de contacto de las personas que realizaron las órdenes.
- Agrupa las órdenes por persona_id y calcula la suma de la cantidad comprada para cada persona.

## 3. Agrupación y Resumen de Datos (Parte 2) (0.5 pt)
- Une el dataset de orden con productos para agregar la información de precios y descuentos a las órdenes.
- Agrupa las órdenes por producto y calcula el total de ingresos por cada producto (considerando el precio,la cantidad comprada y su descuento).

## 4. Análisis de Fechas (1 pt)
- Calcula el tiempo transcurrido desde la primera compra de cada persona hasta la última.

## 5. Analisis descriptivo (2 pt)
- Obtenga los estadisticos básicos para la edad, ingresos y montos
- Obtenga la correlacion entre ingresos de las personas y el monto total de lo que ha comprado.